import Foundation

class NavigatorData {
    static let autoCompleteStations = ["Академмістечко","Житомирська", "Святошин", "Нивки", "Берестейська", "Шулявська", "Політехнічний Інститут", "Вокзальна", "Університет", "Театральна", "Хрещатик", "Арсенальна", "Дніпро", "Гідропарк", "Лівобережна", "Дарниця", "Чернігівська", "Лісова", "Сирець", "Дорогожичі", "Лук'янівська", "Золоті Ворота", "Палац Спорту", "Кловська", "Печерська", "Дружби Народів", "Видубичі", "Славутич", "Осокорки", "Позняки", "Харківська", "Вирлиця", "Бориспільська", "Червоний Хутір", "Героїв Дніпра", "Мінська", "Оболонь", "Петрівка", "Тараса Шевченка", "Контрактова Площа", "Поштова Площа", "Майдан Незалежності", "Площа Льва Толстого", "Палац Україна", "Либідська", "Деміївська", "Голосіївська", "Васильківська", "Виставковий Центр", "Іподром", "Теремки"]
    

    
    static let redLine = [Station("Академмістечко", 0, .red),
                          Station("Житомирська", 130, .red),
                          Station("Святошин", 160, .red),
                          Station("Нивки", 80, .red),
                          Station("Берестейська", 100, .red),
                          Station("Шулявська", 170, .red),
                          Station("Політехнічний Інститут", 100, .red),
                          Station("Вокзальна", 120, .red),
                          Station("Університет", 100, .red),
                          Station("Театральна", 110, .red),
                          Station("Хрещатик", 90, .red),
                          Station("Арсенальна", 120, .red),
                          Station("Дніпро", 100, .red),
                          Station("Гідропарк", 140, .red),
                          Station("Лівобережна", 140, .red),
                          Station("Дарниця", 110, .red),
                          Station("Чернігівська", 120, .red),
                          Station("Лісова", 120, .red)
    ]
    
    static let greenLine = [Station("Сирець", 0, .green),
                            Station("Дорогожичі", 130, .green),
                            Station("Лук'янівська", 200, .green),
                            Station("Золоті Ворота", 270, .green),
                            Station("Палац Спорту", 75, .green),
                            Station("Кловська", 90, .green),
                            Station("Печерська", 105, .green),
                            Station("Дружби Народів", 90, .green),
                            Station("Видубичі", 135, .green),
                            Station("Славутич", 290, .green),
                            Station("Осокорки", 75, .green),
                            Station("Позняки", 120, .green),
                            Station("Харківська", 110, .green),
                            Station("Вирлиця", 120, .green),
                            Station("Бориспільська", 120, .green),
                            Station("Червоний Хутір", 90, .green)
    ]
    
    
    static let blueLine = [Station("Героїв Дніпра", 0, .blue),
                           Station("Мінська", 120, .blue),
                           Station("Оболонь", 100, .blue),
                           Station("Петрівка", 135, .blue),
                           Station("Тараса Шевченка", 150, .blue),
                           Station("Контрактова Площа", 90, .blue),
                           Station("Поштова Площа", 135, .blue),
                           Station("Майдан Незалежності", 120, .blue),
                           Station("Площа Льва Толстого", 90, .blue),
                           Station("Олімпійська", 100, .blue),
                           Station("Палац \"Україна\"", 105, .blue),
                           Station("Либідська", 90, .blue),
                           Station("Деміївська", 105, .blue),
                           Station("Голосіївська", 80, .blue),
                           Station("Васильківська", 120, .blue),
                           Station("Виставковий Центр", 120, .blue),
                           Station("Іподром", 110, .blue),
                           Station("Теремки", 130, .blue)
    ]

}
